import React from "react";
import css from "./sport.module.css";

export default function Sport() {
  return (
    <div>
      <div>
        <img
          src={"/img/benefit.jpg"}
          className={css.benefit}
          alt="benefit.jpg"
        />
      </div>
      <div className={css.main}>
        <h1>Влияние зарядки на организм человека</h1>
        <p className={css.text}>
          В первую очередь пользой утренней зарядки является то, что она
          способно приучить Вас к режиму. Также зарядка помогает улучшить
          обменные процессы в организме, повысить устойчивость организма к
          стрессам. Продлевается молодость, в организме замедляются процессы
          старения, происходит активация клеток головного мозга, позволяя
          сохранять ясность ума весь день, человек становится более выдержанным
          и спокойным. Утренняя зарядка помогает держать себя в форме, а также
          сбросить лишний вес. Физические упражнения помогут улучшить сон,
          аппетит, повысить работоспособность, избавиться от сонливости и
          вялости.
        </p>
      </div>
      <div className={css.main}>
        <h1>Противопоказания</h1>
        <p className={css.text}>
          Если Вы себя хорошо чувствуете, у Вас нет никаких отклонений в
          физическом и психическом развитии, зарядку Вы можете смело делать, не
          боясь последствий. Однако, если у Вас проблемы с сердцем, суставами,
          спиной, то необходимо проконсультироваться с врачом, на предмет того,
          какие упражнения Вам показаны, а какие пока лучше не практиковать.
        </p>
        <h3>Перечень противопоказаний для выполнения утренней зарядки:</h3>
        <ul>
          <li></li>
        </ul>
      </div>
    </div>
  );
}
