const { connect, connection } = require("mongoose");
const Doctor = require("./doctorModel");
require("dotenv").config();

async function seed() {
  connect(
    "mongodb+srv://User1:fktrctq95@cluster0.tnp6y.mongodb.net/medPortal",
    {
      useNewUrlParser: true,
      useUnifiedTopology: true,
    }
  );

  const doctorDB = [
    {
      name: "Калинов Александр Васильевич",
      specialization: "Терапевт",
      work: [["10.00"], ["11:00"], ["12:00"], ["13:00"], ["14:00"]],
      raiting: 4.6,
      reviews: ["быстро принимает", "настоящий профи медицины"],
      img: "doctor.jpeg",
      experience: "18 лет",
      education: "Закончил Российский национальный исследовательский медицинский университет имени Н.И. Пирогова по специальности «Лечебное дело» с красным дипломом.",
      function: "Диагностика и лечение заболеваний сердечно-сосудистой системы. Лечение острых респираторных заболеваний. Диагностика и лечение заболеваний органов дыхания и пищеварения. Выдача листков временной нетрудоспособности.",
    },
    {
      name: "Борщов Денис Александрович",
      specialization: "Ортопед",
      work: [["14:00"], ["15:00"], ["16:00"], ["17:00"], ["18:00"]],
      raiting: 4.1,
      reviews: ["принимает долго"],
      img: "doctor2.jpeg",
      experience: "28 лет",
      education: "Закончил Военно-медицинский факультет при Куйбышевском медицинском институте по специальности: «Лечебное дело». Прошел курс по профессиональной переподготовке по программе «Травматология и ортопедия» на базе МГСУ в 2003 году.",
      function: "Диагностика и лечение переломов верхних и нижних конечностей, грудной клетки, сочетанных и множественных травм (всевозможные методы остеосинтеза: накостный, внутрикостный, внеочаговый, малоинвазивные методы, использование современных биодеградируемых имплантов), повреждений связочномышечного аппарата конечностей и суставов и их последствий, протезирование крупных суставов.",
    },
    {
      name: "Карпенко Анатолий Романович",
      specialization: "Психотерапевт",
      work: [["14:00"], ["15:00"], ["16:00"], ["17:00"], ["18:00"]],
      raiting: 4.1,
      reviews: ["принимает долго"],
      img: "doctor3.jpeg",
      experience: "8 лет",
      education: "Закончил Российский Государственный Медицинский Университет, по специальности: 'Лечебное дело'. Прошел клиническую ординатуру по специальности: 'Психиатрия' в Московском НИИ психиатрии МЗ РФ.",
      function: "Диагностика, современное и безопасное лечение  депрессивных и биполярных расстройств, шизотипического расстройства, шизофрении, невротических, тревожно-фобических, психосоматических расстройств, панического, обсессивно-компульсивного расстройств, расстройств адаптации, посттравматического стрессового расстройства, расстройств личности и поведения, старческого слабоумия, болезни Альцгеймера. Амбулаторное ведение больных  алкоголизмом и наркоманией.",
    },
    {
      name: "Денисова Марина Дмитриевна",
      specialization: "Терапевт - гастроэнтеролог",
      work: [["15:00"], ["16:00"], ["17:00"], ["18:00"], ["19:00"], ["20:00"]],
      raiting: 4.8,
      reviews: ["отличный врач"],
      img: "doctor4.jpeg",
      experience: "11 лет",
      education: "Закончила Российский государственный медицинский университет по специальности «Лечебное дело».",
      function: "Диагностика и лечение терапевтических заболеваний, желудочно-кишечных заболеваний, поджелудочной железы и желчного пузыря.",
    },
    {
      name: "Миронова Снеженна Денисовна",
      specialization: "Хирург",
      work: [["10.00"], ["11:00"], ["12:00"], ["13:00"], ["14:00"], ["15:00"]],
      raiting: 3.2,
      reviews: ["справку в санаторий не дает"],
      img: "doctor5.jpeg",
      experience: "9 лет",
      education: "Закончила Рязанский государственный медицинский университет им. акад. И.П. Павлова по специальности «Лечебное дело». 2016 г. – профессиональная переподготовка по специальности «Ультразвуковая диагностика»",
      function: "Удаление подкожных доброкачественных новообразований, вскрытие, дренирование абсцесса, флегмоны, грыжесечение."
    },
    {
      name: "Образцов Геннадий Филиппович",
      specialization: "Офтальмолог",
      work: [["10.00"], ["11:00"], ["12:00"], ["13:00"], ["14:00"], ["15:00"]],
      raiting: 3.2,
      reviews: ["справку в санаторий не дает"],
      img: "doctor6.jpeg",
      experience: "21 год",
      education: "Закончил Ивановскую государственную медицинскую академию Минздрава России.",
      function: "Лечение воспалительных заболеваний век, конъюнктивы, роговицы, сосудистой оболочки, сетчатки. Лечение нарушений аккомодации. Удаление инородных тел. Вскрытие кист век, ячменей. Лазерная коагуляция сетчатки. Ведение послеоперационных больных.",
    },
    {
      name: "Герберт Брианна Луисовна",
      specialization: "Акушер - гинеколог",
      work: [["10.00"], ["11:00"], ["12:00"], ["13:00"], ["14:00"], ["15:00"]],
      raiting: 3.2,
      reviews: ["справку в санаторий не дает"],
      img: "doctor7.jpeg",
      experience: "15 лет",
      education: "Закончила Российский государственный медицинский университет им. Н.И. Пирогова по специальности «лечебное дело». Прошла курс повышения квалификации: «Методы ультразвуковой диагностики в акушерстве и гинекологии» на базе РАМН НЦ Акушерства, Гинекологии и перинатологии.",
      function: "Ведение беременности, кардиотокография плода, послеродового периода, терапией урогенитальных инфекций, вопросами индивидуального подбора метода контрацепции, гинекологическая эндокринология, УЗИ-диагностика, ведение и удаление ВМК «Мирена», «Импланона», техникой расширенной кольпоскопии, диагностикой и лечением доброкачественных заболеваний шейки матки и удаление кондилом радиоволновым методом аппаратом «Сургитрон».",
    },
  ];

  await Doctor.insertMany(doctorDB);
  console.log("done seed doctors db");
  await connection.close();
}

seed();
