import React from "react";
import css from "./yoga.module.css";

export default function Yoga() {
  return (
    <div className={css.maindiv}>
      <div className={css.main}>
        {/* <h1>Влияние йоги и медитации на организм человека</h1> */}
        <p className={css.main}>
          <h2>Влияние йоги на организм человека</h2>
          <p>
            Бешеный ритм жизни, многозадачность, избыток информации — всё это
            способствует саморазрушению, стрессам, напряжению, блокам и зажимам
            в теле. Мы мало двигаемся, плохо спим, едим на ходу, не умеем
            расслабляться. Йога — это инструмент для самостоятельного
            восстановления себя на всех уровнях, для саморегуляции и
            самодисциплины.
          </p>
          <p>
            Йога состоит из асан (упражнений), дыхательных техник и медитаций,
            поэтому развивает человека всесторонне — через тело, ум и эмоции.
            Сегодня существует множество школ, учителей и направлений йоги по
            всему миру. Некоторые придерживаются традиционных учений, а другие
            объединяют новые и древние техники, поэтому каждый может найти в
            йоге что-то своё. Йога подходит всем — вне зависимости от возраста,
            пола, вероисповедания и физической подготовки. При этом йога — это
            не спорт и не фитнес в привычном понимании.
          </p>
        </p>
      </div>
      <div className={css.main}>
        <h2>Противопоказания</h2>
        <p className={css.main}>
          Исключение составляют некоторые заболевания, при которых польза йоги
          подвергается сомнению и её практика даже может навредить: инфекции
          мозга и позвоночника, злокачественные опухоли, психические болезни,
          острые заболевания внутренних органов.
        </p>
       <div>
       <img
        src={"/img/reason_yoga.jpeg"}
        className={css.imgyoga}
        alt="reasonsforyoga"
      />
       </div>
      </div>
    </div>

  );
}
