import React from "react";

const Communication = () => {
  return (
    <div>
      <p>
        "Горячая линия" Росздравнадзора по соблюдению прав граждан в сфере
        охраны здоровья: 8 (800) 550-99-03
      </p>
      <p>
        Начальник отдела координации медицинской помощи в городe Сочи
        Официальный e-mail: mz@krasnodar.ru Контактные телефоны: 8 (861)
        266-06-06
      </p>
      <p>
        Телефон горячей линии министерства здравоохранения Краснодарского края
        8-800-200-03-66 (круглосуточно).
      </p>
    </div>
  );
};

export default Communication;
